Autodesk.Navisworks.Api.ViewpointRenderStyle
The render style of the viewpoint

Autodesk.Navisworks.Api.ViewpointRenderStyle.FullRender
Highest quality, as specified in model

Autodesk.Navisworks.Api.ViewpointRenderStyle.Preview
Lower quality, same appearance

Autodesk.Navisworks.Api.ViewpointRenderStyle.Shaded
Smooth shaded (simple shade model, no textures)

Autodesk.Navisworks.Api.ViewpointRenderStyle.Wireframe
Wire frame

Autodesk.Navisworks.Api.ViewpointRenderStyle.HiddenLine
Hidden line wire frame